Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotPasteDifferentViewSpecificElements Property
 Cannot paste view-specific elements from different views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPasteDifferentViewSpecificElements { get; }
Visual Basic
Public Shared ReadOnly Property CannotPasteDifferentViewSpecificElements As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPasteDifferentViewSpecificElements {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace